Repository: YutaHasimoto/OthelloApp
Catalog: OthelloApp/Localizable.xcstrings
Source language: ja
Languages: en, es, fr, ko, pt_br, zh_hans

# accessibility.board_cell_legal
source: %1$@、%2$@、置ける場所
en: %1$@, %2$@, available move
es: %1$@, %2$@, jugada disponible
fr: %1$@, %2$@, coup possible
ko: %1$@, %2$@, 놓을 수 있는 칸
pt_br: %1$@, %2$@, jogada disponível
zh_hans: %1$@，%2$@，可以落子

# accessibility.dismiss_result
source: リザルトを閉じる
en: Close results
es: Cerrar resultados
fr: Fermer les résultats
ko: 결과 닫기
pt_br: Fechar resultados
zh_hans: 关闭结果

# accessibility.locked
source: %@、ロック中
en: %@, locked
es: %@, bloqueado
fr: %@, verrouillé
ko: %@, 잠김
pt_br: %@, bloqueado
zh_hans: %@，已锁定

# accessibility.show_board
source: 盤面を表示するにゃ
en: Show the board, meow
es: Mostrar el tablero, miau
fr: Afficher le plateau, miaou
ko: 보드를 표시한다냥
pt_br: Mostrar o tabuleiro, miau
zh_hans: 显示棋盘，喵

# alert.reset.cancel
source: 続ける
en: Keep Playing
es: Seguir jugando
fr: Continuer
ko: 계속하기
pt_br: Continuar jogando
zh_hans: 继续游戏

# alert.reset.confirm
source: やりなおす
en: Restart
es: Reiniciar
fr: Recommencer
ko: 다시 시작
pt_br: Reiniciar
zh_hans: 重新开始

# alert.reset.message
source: 今の盤面を最初からに戻すにゃ。
en: Reset the current board to its starting position.
es: Devuelve el tablero a la posición inicial.
fr: Remet le plateau à sa position initiale.
ko: 현재 보드를 시작 상태로 되돌린다냥.
pt_br: Volta o tabuleiro à posição inicial.
zh_hans: 将当前棋盘恢复到初始状态。

# alert.reset.title
source: ゲームをやりなおすにゃ？
en: Restart the game, meow?
es: ¿Reiniciar la partida, miau?
fr: Recommencer la partie, miaou ?
ko: 게임을 다시 시작할 거냥?
pt_br: Reiniciar a partida, miau?
zh_hans: 要重新开始游戏吗，喵？

# board.position
source: %1$lld行%2$lld列
en: row %1$lld, column %2$lld
es: fila %1$lld, columna %2$lld
fr: ligne %1$lld, colonne %2$lld
ko: %1$lld행 %2$lld열
pt_br: linha %1$lld, coluna %2$lld
zh_hans: 第%1$lld行，第%2$lld列

# celebration.unlock_message
source: 新しい相手が待ってるにゃ
en: A new opponent awaits, meow
es: Un nuevo rival te espera, miau
fr: Un nouvel adversaire t’attend, miaou
ko: 새로운 상대가 기다리고 있다냥
pt_br: Um novo rival espera por você, miau
zh_hans: 新的对手在等你，喵

# celebration.unlock_title
source: 鬼 解放にゃ
en: Oni Unlocked, Meow!
es: ¡Oni desbloqueado, miau!
fr: Oni débloqué, miaou !
ko: 오니 난이도 해제다냥!
pt_br: Oni desbloqueado, miau!
zh_hans: 鬼级已解锁，喵！

# celebration.victory_message
source: CPUに勝ったにゃ
en: You beat the CPU, meow
es: Has vencido a la CPU, miau
fr: Tu as battu l’ordinateur, miaou
ko: CPU를 이겼다냥
pt_br: Você venceu a CPU, miau
zh_hans: 你打败了电脑，喵

# celebration.victory_title
source: 勝利にゃ！
en: Victory, Meow!
es: ¡Victoria, miau!
fr: Victoire, miaou !
ko: 승리다냥!
pt_br: Vitória, miau!
zh_hans: 胜利啦，喵！

# control.menu
source: メニュー
en: Menu
es: Menú
fr: Menu
ko: 메뉴
pt_br: Menu
zh_hans: 菜单

# control.reset
source: やりなおし
en: Restart
es: Reiniciar
fr: Recommencer
ko: 다시 시작
pt_br: Reiniciar
zh_hans: 重新开始

# control.undo
source: 一手戻る
en: Undo Move
es: Deshacer jugada
fr: Annuler le coup
ko: 한 수 무르기
pt_br: Desfazer jogada
zh_hans: 悔棋

# difficulty.easy
source: やさしい
en: Easy
es: Fácil
fr: Facile
ko: 쉬움
pt_br: Fácil
zh_hans: 简单

# difficulty.normal
source: ふつう
en: Normal
es: Normal
fr: Normal
ko: 보통
pt_br: Normal
zh_hans: 普通

# difficulty.oni
source: 鬼
en: Oni
es: Oni
fr: Oni
ko: 오니
pt_br: Oni
zh_hans: 鬼级

# difficulty.strong
source: つよい
en: Strong
es: Difícil
fr: Difficile
ko: 어려움
pt_br: Difícil
zh_hans: 困难

# disc.black
source: 黒
en: Black
es: Negras
fr: Noir
ko: 흑돌
pt_br: Pretas
zh_hans: 黑棋

# disc.empty
source: 空き
en: Empty
es: Vacía
fr: Vide
ko: 빈칸
pt_br: Vazio
zh_hans: 空位

# disc.unit
source: 石
en: discs
es: fichas
fr: pions
ko: 개
pt_br: peças
zh_hans: 枚

# disc.white
source: 白
en: White
es: Blancas
fr: Blanc
ko: 백돌
pt_br: Brancas
zh_hans: 白棋

# game.cpu_thinking
source: CPUが考え中にゃ
en: CPU is thinking, meow
es: La CPU está pensando, miau
fr: L’ordinateur réfléchit, miaou
ko: CPU가 생각 중이다냥
pt_br: A CPU está pensando, miau
zh_hans: 电脑正在思考，喵

# game.draw
source: 引き分けにゃ
en: It's a draw, meow
es: Empate, miau
fr: Match nul, miaou
ko: 무승부다냥
pt_br: Empate, miau
zh_hans: 平局，喵

# game.invalid_move
source: そこには置けないにゃ
en: You can't place a disc there, meow
es: No puedes poner una ficha ahí, miau
fr: Impossible de poser un pion ici, miaou
ko: 거기에는 놓을 수 없다냥
pt_br: Não dá para colocar uma peça aí, miau
zh_hans: 那里不能落子，喵

# game.move
source: %1$@が%2$@に置いたにゃ
en: %1$@ placed a disc at %2$@, meow
es: %1$@ ha puesto una ficha en %2$@, miau
fr: %1$@ a posé un pion en %2$@, miaou
ko: %1$@이 %2$@에 돌을 놓았다냥
pt_br: %1$@ colocou uma peça em %2$@, miau
zh_hans: %1$@在%2$@落子，喵

# game.pass
source: %@は置けないのでパスにゃ
en: %@ has no legal move and passes, meow
es: %@ no puede jugar y pasa, miau
fr: %@ ne peut pas jouer et passe, miaou
ko: %@은 놓을 곳이 없어 차례를 넘긴다냥
pt_br: %@ não tem jogada e passa, miau
zh_hans: %@无棋可下，跳过回合，喵

# game.start_black
source: 黒からスタートにゃ
en: Black starts, meow
es: Empiezan las negras, miau
fr: Les noirs commencent, miaou
ko: 흑돌부터 시작이다냥
pt_br: As pretas começam, miau
zh_hans: 黑棋先行，喵

# game.turn
source: %@の番にゃ
en: %@'s turn, meow
es: Turno de %@, miau
fr: Au tour de %@, miaou
ko: %@ 차례다냥
pt_br: Vez de %@, miau
zh_hans: 轮到%@，喵

# game.undo
source: 一手戻したにゃ
en: Undid one move, meow
es: Jugada deshecha, miau
fr: Coup annulé, miaou
ko: 한 수를 되돌렸다냥
pt_br: Jogada desfeita, miau
zh_hans: 已悔一步，喵

# game.winner
source: %@の勝ちにゃ
en: %@ wins, meow
es: Ganan las %@, miau
fr: Les %@ gagnent, miaou
ko: %@ 승리다냥
pt_br: As %@ vencem, miau
zh_hans: %@获胜，喵

# menu.cpu_battle
source: CPU対戦
en: Play vs CPU
es: Jugar contra la CPU
fr: Jouer contre l’ordinateur
ko: CPU와 대전
pt_br: Jogar contra a CPU
zh_hans: 对战电脑

# menu.leaderboard_requires_game_center
source: ランキングの表示にはGame Centerへのサインインが必要です
en: Sign in to Game Center to view the leaderboard.
es: Inicia sesión en Game Center para ver la clasificación.
fr: Connectez-vous à Game Center pour voir le classement.
ko: 순위표를 보려면 Game Center에 로그인하세요.
pt_br: Inicie sessão no Game Center para ver o ranking.
zh_hans: 登录 Game Center 后即可查看排行榜。

# menu.oni_leaderboard
source: おに戦ランキング
en: Oni CPU Leaderboard
es: Clasificación CPU Oni
fr: Classement CPU Oni
ko: 오니 CPU 순위표
pt_br: Ranking da CPU Oni
zh_hans: 鬼级电脑排行榜

# menu.two_player_battle
source: 2人対戦
en: Two Players
es: Dos jugadores
fr: Deux joueurs
ko: 2인 대전
pt_br: Dois jogadores
zh_hans: 双人对战

# mode.two_players
source: 2人
en: 2 Players
es: 2 jugadores
fr: 2 joueurs
ko: 2인
pt_br: 2 jogadores
zh_hans: 双人

# result.cpu_draw
source: CPU %@と引き分けにゃ
en: You drew with the %@ CPU, meow
es: Empate contra la CPU %@, miau
fr: Égalité contre l’ordinateur %@, miaou
ko: %@ CPU와 비겼다냥
pt_br: Empate contra a CPU %@, miau
zh_hans: 与%@电脑打成平局，喵

# result.cpu_victory
source: CPU %@の勝利にゃ
en: The %@ CPU wins, meow
es: Gana la CPU %@, miau
fr: L’ordinateur %@ gagne, miaou
ko: %@ CPU가 이겼다냥
pt_br: A CPU %@ venceu, miau
zh_hans: %@电脑获胜，喵

# result.human_victory
source: CPU %@に勝利したにゃ
en: You beat the %@ CPU, meow
es: Has vencido a la CPU %@, miau
fr: Tu as battu l’ordinateur %@, miaou
ko: %@ CPU를 이겼다냥
pt_br: Você venceu a CPU %@, miau
zh_hans: 你打败了%@电脑，喵

# result.in_progress
source: 対戦中にゃ
en: Game in progress, meow
es: Partida en curso, miau
fr: Partie en cours, miaou
ko: 대전 중이다냥
pt_br: Partida em andamento, miau
zh_hans: 对局进行中，喵

# result.menu
source: メニューへ
en: Back to Menu
es: Volver al menú
fr: Retour au menu
ko: 메뉴로
pt_br: Voltar ao menu
zh_hans: 返回菜单

# result.play_again
source: もう一度対戦
en: Play Again
es: Jugar de nuevo
fr: Rejouer
ko: 다시 대전
pt_br: Jogar novamente
zh_hans: 再来一局

# result.play_to_finish
source: 最後まで打って勝負を決めるにゃ
en: Play to the end to decide the winner, meow
es: Juega hasta el final para decidir, miau
fr: Joue jusqu’au bout pour décider, miaou
ko: 끝까지 두어 승부를 결정하자냥
pt_br: Jogue até o fim para decidir, miau
zh_hans: 下到最后决出胜负吧，喵

# result.score
source: 最終スコア、黒%1$lld石、白%2$lld石
en: Final score: Black %1$lld discs, White %2$lld discs
es: Resultado final: negras %1$lld, blancas %2$lld
fr: Score final : noirs %1$lld, blancs %2$lld
ko: 최종 점수: 흑돌 %1$lld개, 백돌 %2$lld개
pt_br: Placar final: pretas %1$lld, brancas %2$lld
zh_hans: 最终比分：黑棋%1$lld枚，白棋%2$lld枚

# result.two_player_message
source: 最終スコアを確認して、すぐ再戦できるにゃ
en: Check the final score and play again right away, meow
es: Mira el resultado y vuelve a jugar, miau
fr: Consulte le score et rejoue, miaou
ko: 최종 점수를 확인하고 바로 다시 대전할 수 있다냥
pt_br: Confira o placar e jogue de novo, miau
zh_hans: 看看最终比分，马上再来一局吧，喵

# result.label
source: RESULT
es: RESULTADO
fr: RÉSULTAT
ko: 결과
pt_br: RESULTADO
zh_hans: 结果

# mode.cpu
source: CPU
fr: Ordinateur
zh_hans: 电脑

# player.cpu
source: CPU %@
fr: Ordinateur %@
zh_hans: %@电脑
